title: BlackGuard Stealer Targets the Gaming Community
description: BlackGuard Stealer Targets the Gaming Community
author: Anil Yelken
references:
- https://otx.alienvault.com/pulse/62b042a4dc7e6887c7ed414a
date: 2022/06/28
status: experimental
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: 1
    file_hash:
    - b16bb8ce89c42e0f48deb5ba2a8b5c7495c8702c7c2c5c0af7d38739f6281ebb
    - a0cc5f36b04eae3db5582ec2563ed77e83783765addd3460313377c6fcd1b96d
    - 5293c26f29b4af6bc2f3f74ae1ed93537e6c311a695cc0a6920a635c57383617
    - 352c936eaf45ffd2f99ba2a9e726eaa39af29d4c37a6ad5106849f07aa35896c
    - ee3a164339db9e2441c035932ae382150f489fb1
    - 7cadb3d6d6581c2bc3642653b9286b71
  condition: selection
fields:
- Hashes
falsepositives:
- Unknown
level: high
tags:
- attack.t1566
- attack.t1496
- attack.t1503
- attack.t1020
