title: Twisted Panda: Chinese APT espionage operation against Russian’s state-owned defense institutes
description: Twisted Panda: Chinese APT espionage operation against Russian’s state-owned defense institutes
author: Anil Yelken
references:
- https://research.checkpoint.com/2022/twisted-panda-chinese-apt-espionage-operation-against-russians-state-owned-defense-institutes/
- https://otx.alienvault.com/pulse/628755c56b3dff4b4459107b
date: 2022/05/23
status: stable
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: 1
    file_hash:
    - 027845550d7a0da404f0f331178cb28b
    - 06865195c326ff587b2c0bed16021d08
    - 176d7239887a9d0dd24e2cce904277bc
    - 1f9a72dc91759cd06a0f05ac4486dda1
    - 25f3da186447794de5af2fa3ff3bcf23
    - 312dcd11c146323876079f55ca371c84
    - 3855dc19811715e15d9775a42b1a6c55
    - 443c66275e2802c00afe2cf16f147737
    - 69ab42012ddce428c73940dcf343910e
    - 6d4bf8dd4864f9ac564d3c9661b99190
    - 7a371437e98c546c6649713703134727
    - 7dd4c80acc4dca33af0d26477efe2002
    - 90e6878ebfb3e962523f03f9d411b35c
    - ce02ee477e1188f0664dd65b17e83d11
    - d723c18baea565c9263dca0eb3a11904
    - d95bbe8a97d864dc40c9cf845aeb4e9e
    - daa1da9b515a32032bc621e71d4ae4ca
    - daa1da9b515a32032bc621e71d4ae4ca
    - fd73eeead785470f79536e9eb2eb6ef2
    - 2d973dcb77024ea0efbce13e1a53446129f43f2c
    - 388a1481b7887ebf56de26717c3ddabd6c447442
    - 5ce0a2730e76891931d5fd8b28a36efb916a40d9
    - 698d1ade6defa07fb4e4c12a19ca309957fb9c40
    - 7451b72874b712948bd72ba9047e137a656b88b5
    - 8c42f1fce4d415e1a358586383c2deae15f493b9
    - cbaa7026d3bcc1e1fcbe26b0f4a69708aeee7fe7
    - eafa4487437871c643d0518267b10ad76a03f2c1
    - 28ecd1127bac08759d018787484b1bd16213809a2cc414514dc1ea87eb4c5ab8
    - 3001f0a05df31eee89d1bb3721b9cd060c1f20088d4e91bc1d0b243ba73e36f8
    - 436d5bf9eba974a6e97f6f5159456c642e53213d7e4f8c75db5275b66fedd886
    - 59dea38da6e515af45d6df68f8959601e2bbf0302e35b7989e741e9aba2f0291
    - 5a457a094734102c2516624d4e207d9ea7b8787931ebcb69d5ba3814f00b37ea
    - 5b558c5fcbed8544cb100bd3db3c04a70dca02eec6fedffd5e3dcecb0b04fba0
    - 8b04479fdf22892cdfebd6e6fbed180701e036806ed0ddbe79f0b29f73449248
    - a9fb7bb40de8508606a318866e0e5ff79b98f314e782f26c7044622939dfde81
    - c0951f5a60c98fa4fc79b524e89de3d290d3acd2d4a480a641f8c2bd838b0836
    - defd44e440403033f9a0f222439c2b6a2bd670817dd483ad1bbae11c30e81034
    - e0d4ef7190ff50e6ad2a2403c87cc37254498e8cc5a3b2b8798983b1b3cdc94f
    - efa754450f199caae204ca387976e197d95cdc7e83641444c1a5a91b58ba6198
    - f29a0cda6e56fc0e26efa3b6628c6bcaa0819a3275a10e9da2a8517778152d66
  condition: selection
fields:
- Hashes
falsepositives:
- Unknown
level: high
tags:
- attack.t1140
- attack.t1566
- attack.t1574
- attack.t1027
- attack.t1059
- attack.t1055
- attack.t1106
- attack.t1082
